ЛИС2/src/Catalogs/ТочкиКонтроля/ТочкиКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиКонтроля</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
      <types>CatalogRef.ЛинейныеОбъекты</types>
      <types>CatalogRef.ЛицензионныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыСевернойШироты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыВосточнойДолготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалено_Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтвора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НольГрафика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОтбораПроб</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ИсточникиЗагрязнения</types>
      <types>CatalogRef.Водозаборы</types>
      <types>CatalogRef.СелитебныеЗоны</types>
      <types>CatalogRef.Скважины</types>
      <types>CatalogRef.СанитарноЗащитныеЗоны</types>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКТМО</name>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПунктаНаблюдения</name>
    <type>
      <types>EnumRef.КатегорииПунктаНаблюдения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаКонтроляНаходитсяНаЛинейномОбъекте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныйОбъект</name>
    <type>
      <types>CatalogRef.ЛинейныеОбъекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьЗВФакторов</name>
    <attributes>
      <name>ЗагрязняющееВеществоФакторВоздействия</name>
      <type>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Enums/РазделыУчетаЭкоаналитическогоКонтроля/РазделыУчетаЭкоаналитическогоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыУчетаЭкоаналитическогоКонтроля</name>
  <enumValues>
    <name>ПромышленныеВыбросы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныйВоздух</name>
  </enumValues>
  <enumValues>
    <name>СточныеВоды</name>
  </enumValues>
  <enumValues>
    <name>ПриродныеВоды</name>
  </enumValues>
  <enumValues>
    <name>Почвы</name>
  </enumValues>
  <enumValues>
    <name>ДонныеОтложения</name>
  </enumValues>
  <enumValues>
    <name>ФизическиеФакторы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныеОсадки</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/ТочкиКонтроля/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Установка отбора в зависимости от раздела контроля.
	Если Параметры.Свойство("ОтборПоРазделуКонтроля") Тогда 																	  
		
		Если Параметры.ОтборПоРазделуКонтроля = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.Почвы") Или
			Параметры.ОтборПоРазделуКонтроля = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ФизическиеФакторы") Тогда 
			
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПочваФизФакторы", Истина);
			Список.Параметры.УстановитьЗначениеПараметра("ОтборДонныеОтложения", Ложь);
			
		ИначеЕсли Параметры.ОтборПоРазделуКонтроля = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ДонныеОтложения") Тогда
			
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПочваФизФакторы", Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("ОтборДонныеОтложения", Истина);
			
		Иначе
			
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПочваФизФакторы", Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("ОтборДонныеОтложения", Ложь);
						
		КонецЕсли; // Если Параметры.ОтборПоРазделуКонтроля = ПредопределенноеЗначени 
		
	Иначе	
		
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПочваФизФакторы", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ОтборДонныеОтложения", Ложь);
		
	КонецЕсли; // Если Параметры.Свойство("ОтборПочваФизФакторы") Тогда
	
	// (++) Зиновьев А.В., 28.02.2017
	Если Параметры.Свойство("ЛицензионныйУчасток") Тогда		
		Список.Параметры.УстановитьЗначениеПараметра("ЛицензионныйУчасток", Параметры.ЛицензионныйУчасток);		
	Иначе	
		Список.Параметры.УстановитьЗначениеПараметра("ЛицензионныйУчасток", ПредопределенноеЗначение("Справочник.ЛицензионныеУчастки.ПустаяСсылка"));		
	КонецЕсли; 
	// (--) Зиновьев А.В., 28.02.2017
	
	// (++) Зиновьев А.В., 29.05.2017
	// Отбор по линейному объекту.
	Если Параметры.Свойство("ЛинейныйОбъект") Тогда
		
		Если Параметры.Отбор.Свойство("ОбъектКонтроля") Тогда
			Параметры.Отбор.Удалить("ОбъектКонтроля");
		КонецЕсли; 
		
		Группа = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		Группа.Использование = Истина;
		Группа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
		
		ЭлОтбора = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектКонтроля");
		ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора.Использование	= Истина;
		ЭлОтбора.ПравоеЗначение = Параметры.ЛинейныйОбъект;
		
		ЭлОтбора = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛинейныйОбъект");
		ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора.Использование	= Истина;
		ЭлОтбора.ПравоеЗначение = Параметры.ЛинейныйОбъект;	
		
	КонецЕсли;
	// (--) Зиновьев А.В., 29.05.2017
	
	
	
КонецПроцедуры // Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
